#language: ru

  Функционал: Проверка списка курсов на главной странице

    Сценарий: Выбор самого раннего курса на странице
      Пусть Открываем главную страницу
      Если Кликнуть на самый ранний курс на странице
      Тогда Откроется страница курса

    Сценарий: Выбор самого позднего курса на странице
      Пусть Открываем главную страницу
      Если Кликнуть на самый поздний курс на странице
      Тогда Откроется страница курса

    Сценарий: Выбор курса по названию на странице
      Пусть Открываем главную страницу
      Если Кликнуть курс с названием "Специализация iOS Developer" на странице
      Тогда Откроется страница курса